nrel5mw_clean/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (11.4 0 0);
pressure             0;
turbulentKE          0.48735; //Guess for I = 0.05, k = 3/2*I^2*U_infty^2
turbulentEpsilon     4.860303e-4; ////Guess ~ 0.09*k**(3/2)/l

// ************************************************************************* //
